In [1]:
from sqlalchemy import create_engine # pip install sqlalchemy
import pymysql # conda install pymysql
import pandas as pd

In [2]:
print(f'pymysql version: {pymysql.__version__}')
print(f'pandas  version: {pd.__version__}')

pymysql version: 0.9.3
pandas  version: 0.23.4

## create a connection to MySQL

In [3]:
uid='guest'
pwd='relational'
host='relational.fit.cvut.cz'
port=3306
db='imdb_small'
con_string=f'mysql+pymysql://{uid}:{pwd}@{host}:{port}/{db}'
print(f'connection string = {con_string}')
con=create_engine(con_string)
# con = create_engine('mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/imdb_small')

connection string = mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/imdb_small

In [4]:
con.table_names()

['actors',
 'directors',
 'directors_genres',
 'movies',
 'movies_directors',
 'movies_genres',
 'roles']

In [5]:
r = con.execute("select * from movies limit 5;").fetchall()
r

[(10920, 'Aliens', 1986, 8.2),
 (17173, 'Animal House', 1978, 7.5),
 (18979, 'Apollo 13', 1995, 7.5),
 (30959, 'Batman Begins', 2005, None),
 (46169, 'Braveheart', 1995, 8.3)]

In [6]:
sql = "select * from movies limit 10;"
df = pd.read_sql(sql, con)
df

       id             name  year  rank
0   10920           Aliens  1986   8.2
1   17173     Animal House  1978   7.5
2   18979        Apollo 13  1995   7.5
3   30959    Batman Begins  2005   NaN
4   46169       Braveheart  1995   8.3
5  109093            Fargo  1996   8.2
6  111813  Few Good Men, A  1992   7.5
7  112290       Fight Club  1999   8.5
8  116907        Footloose  1984   5.8
9  124110     Garden State  2004   8.3

In [7]:
sql = """
    select year, count(id) as cnt 
        from movies 
        group by year 
        order by cnt desc 
        limit 5
"""
df = pd.read_sql(sql, con)
df

   year  cnt
0  1999    4
1  2000    4
2  2003    4
3  2001    3
4  1994    2

In [8]:
sql = """
    select * 
        from movies 
        where rank > %s
        order by rank desc 
        limit 5
"""
df = pd.read_sql(sql, con, params=[8])
df

       id                       name  year  rank
0  297838  Shawshank Redemption, The  1994   9.0
1  130128             Godfather, The  1972   9.0
2  313459                  Star Wars  1977   8.8
3  210511                    Memento  2000   8.7
4  267038               Pulp Fiction  1994   8.7

In [9]:
sql = """
    select * 
        from movies 
        where rank > %s and year > %s
        order by rank desc 
        limit 5
"""
df = pd.read_sql(sql, con, params=[8, 2000])
df

       id               name  year  rank
0  176711  Kill Bill: Vol. 1  2003   8.4
1  124110       Garden State  2004   8.3
2  176712  Kill Bill: Vol. 2  2004   8.2
3  224842       Mystic River  2003   8.1
4  300229              Shrek  2001   8.1

In [10]:
sql = """
    select * 
        from movies 
        where rank > 8 and year > 2000
        order by rank desc 
        limit 5
"""
df = pd.read_sql(sql, con)
df

       id               name  year  rank
0  176711  Kill Bill: Vol. 1  2003   8.4
1  124110       Garden State  2004   8.3
2  176712  Kill Bill: Vol. 2  2004   8.2
3  224842       Mystic River  2003   8.1
4  300229              Shrek  2001   8.1